#Made by ✓RAYEES SIAVASH BADAKHSHI✓

import os
import time
time.sleep(3.0)
os.system("apt update")
os.system("apt upgrade")
time.sleep(3.0)
logo="""
 ███████╗██╗ █████╗ ██╗   ██╗ █████╗ ███████╗██╗  ██╗
 ██╔════╝██║██╔══██╗██║   ██║██╔══██╗██╔════╝██║  ██║
 ███████╗██║███████║██║   ██║███████║███████╗███████║
      ██║██║██╔══██║╚██╗ ██╔╝██╔══██║╚════██║██╔══██║
 ███████║██║██║  ██║ ╚████╔╝ ██║  ██║███████║██║  ██║
 ╚══════╝╚═╝╚═╝  ╚═╝  ╚═══╝  ╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝
 \x1b[1;97m🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹
\033[1;31m         HACEKR RaYees SiaVash Badakhshi 💛👈 \33[0m
\x1b[1;97m🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔹
\033[1;32m[+] 𝗔𝗨𝗧𝗛𝗢𝗥 | SiaVash
\033[1;33m[+] 𝗙𝗔𝗖𝗘𝗕𝗢𝗢𝗞 | RaYees SiaVash
\033[1;34m[+] 𝗚𝗜𝗧𝗛𝗨𝗕  | Badakhshan Hack
\033[1;35m[+] 𝗧𝗘𝗔𝗠   |   \33[1;42  Afghan Hacker \33[0m
\033[1;36m[+] 𝗩𝗘𝗥𝗦𝗜𝗢𝗡 |\x1b[1;97m    2.0.1   \x1b[1;97m          
\x1b[1;97m🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹
"""

os.system("clear")
print(logo)

print("")
print("\033[1;37m [1] 𝗙𝗶𝗿𝘀𝘁 FOLLOW MY Facebook Account ")
print("\033[1;37m [2] 𝗘𝘅𝗶𝘁")
print("")
Badakhsh = input("\n\033[1;37m  Choose : \033[1;32m")
if Badakhsh in ["", " "]:
	exit()
elif Badakhsh in ["2", "02"]:
	print("    Thanks♥️")
	exit()
elif Badakhsh in ["1", "01"]:
	os.system("xdg-open https://www.facebook.com/profile.php?id=100041248659496")
else:
	exit()
print("\033[1;37m    𝗖𝗛𝗘𝗖𝗞𝗜??𝗚 𝗔𝗣𝗣𝗥𝗢𝗩𝗔𝗟 ")
print("")
name = input("\n\033[1;37m TYᑭᗴ Tᕼᗴ  ᖴᗩᑕᗴᗷOOK ᗩᑕᑕOᑌᑎT ᑎᗩᗰᗴ \033[1;37m")
if name == ("RaYees SiaVash"):
	time.sleep(3.1)
	print("\033[1;32m WELCOME TO   RaYees SiaVash  HACKINGS TOOL 🔥")
else:
	print("Facebook name is false," "😑")
	exit()
time.sleep(3.0)
os.system("clear")
print(logo)
print(" [+]𝗠𝗘𝗡𝗨  𝗠𝗘𝗧𝗛𝗢𝗗")
print("\033[1;37m  🔹🔹🔹🔸🔹🔸🔹🔸🔹🔸🔹🔹🔹🔸🔹🔸🔹🔸🔹🔸🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔸🔹🔸🔹🔹🔸🔹")


print(" \033[1;32m[1]\033[0;92m :::::::::➤Facebook Hack ")
print(" \033[1;32m[2] :::::::::➤Email Hack")
print("\033[1;32m [3] :::::::::➤ᴇxɪᴛ \n")
user=input("Chose ==>")
print(user)
os.system("xdg-open https://www.facebook.com/profile.php?id=100041248659496")
print("")
os.system("clear")
print(logo)
print("")
if user in ["1", "01"]:
	user = input("\033[1;31m" "[+]Enter ID ==>?")
	print(user)
if user in ["2", "02"]:
	user = input("\033[1;34m" "[+]Enter Email ==>?")
	print(user)
if user in ["3", "03"]:
	exit()
time.sleep(3.0)
print("\n\033[0;94m [+] please Wait")
time.sleep(5.0)
print("")
print("Checking the password list")
print(" ")
number = 15988
while number < 158342:
	time.sleep(2.0)
	print(number)
	number += 12792
time.sleep(5.0)
os.system("clear")
print(logo)
print('''🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸''')
print("\033[1;31m" " [+]Boro Chosk to Bokhur Torh Chy Bh in Gpha\x1b[1;97m","👶🍼😂🤧 ")
